In [2]:
#install Pandas
!pip install pandas

Requirement already satisfied: pandas in c:\users\dell\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\dell\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
#import packages
import pandas as pd
import numpy as np

lst=[10,20,30,40]
arr1=np.array(lst)

In [4]:
pd.Series([lst,lst,lst])

0    [10, 20, 30, 40]
1    [10, 20, 30, 40]
2    [10, 20, 30, 40]
dtype: object

In [5]:
df=pd.DataFrame([lst,lst,lst,lst],columns=["A","B","C","D"])

In [6]:
df

    A   B   C   D
0  10  20  30  40
1  10  20  30  40
2  10  20  30  40
3  10  20  30  40

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
del df

In [9]:
#Series through List
lst=[10,20,30,40,50]
pd.Series(lst)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [10]:
dct={"name":"Tejaswini Phasale","RollNo":150,"Age":20}
pd.Series(dct)

name      Tejaswini Phasale
RollNo                  150
Age                      20
dtype: object

In [11]:
pd.Series(index=["Name","RollNo","Age"],data=["Tejaswini",150,20])

Name      Tejaswini
RollNo          150
Age              20
dtype: object

In [12]:
import pandas as pd
pd.Series(5).repeat(5)

0    5
0    5
0    5
0    5
0    5
dtype: int64

In [13]:
pd.Series([4,5]).repeat([2,3])

0    4
0    4
1    5
1    5
1    5
dtype: int64

In [14]:
type(pd.Series([4,5]).repeat([2,3]).reset_index())

pandas.core.frame.DataFrame

In [15]:
type(pd.Series([4,5]).repeat([2,3]).reset_index(drop=True))

pandas.core.series.Series

In [16]:
ser=pd.Series(["Tejaswini   ", "Shamrao  ","   Phasale"])
print(ser.str.upper())
print(ser.str.lower())

0    TEJASWINI
1       SHAMRAO
2         PHASALE
dtype: object
0    tejaswini
1       shamrao
2         phasale
dtype: object

In [17]:
#Length of String
for i in ser:
    print(i,"=",len(i))

Tejaswini    = 12
Shamrao   = 9
   Phasale = 10

In [18]:
#Remove the extra spaces(strip function used to remove extra spaces)
ser=ser.str.strip()
print(ser)

for i in ser:
    print(i,"=",len(i))

0    Tejaswini
1      Shamrao
2      Phasale
dtype: object
Tejaswini = 9
Shamrao = 7
Phasale = 7

In [19]:
print(pd.Series(['10/03/1983','10/03/1994','29/10/1998']).str.split('/'))

0    [10, 03, 1983]
1    [10, 03, 1994]
2    [29, 10, 1998]
dtype: object

In [20]:
#Contains Function
ser=pd.Series(["Tejaswini Phasale","Data@Scientist","GFG","Machine@Learning"])
ser.str.contains("@")

0    False
1     True
2    False
3     True
dtype: bool

In [21]:
#Replace Function
ser=pd.Series(["Tejaswini Phasale","Data@Scientist","GFG","Machine@Learning"])
ser.str.replace('@',' ')

0    Tejaswini Phasale
1       Data Scientist
2                  GFG
3     Machine Learning
dtype: object

In [22]:
#count function
ser.str.count('a')

0    3
1    2
2    0
3    2
dtype: int64

In [23]:
#startswith and endswith
ser.str.startswith("Tej")
ser.str.endswith("g")

0    False
1    False
2    False
3     True
dtype: bool

In [24]:
pd.Series(["Tejaswini","Tejaswini","Phasale","xyz","abcd"])
ser.str.count("Tejaswini")

0    1
1    0
2    0
3    0
dtype: int64

In [25]:
ser=pd.Series(["Tejaswini","Tejaswini","Phasale","xyz","abcd"])

In [26]:
type(ser.to_list())

list

In [27]:
lst=["gfg","Tejaswini","Phasale","Data Scientist"]
df=pd.DataFrame(lst)
print(df)

                0
0             gfg
1       Tejaswini
2         Phasale
3  Data Scientist

In [29]:
lst=[[1,"gfg","xyz"],[2,"Tejaswini","abc"],[3,"Phasale","gd"],[4,"Data Scientist","yes"]]
df=pd.DataFrame(lst)
print(df)

   0               1    2
0  1             gfg  xyz
1  2       Tejaswini  abc
2  3         Phasale   gd
3  4  Data Scientist  yes

In [44]:
#Creating DataFrame from dict of ndarraylists
data={'name':["Tom","nick","krish","jack"],"Age":[20,21,19,18],"Address":["abc","xyz","fgx","hgf"]}
df=pd.DataFrame(data)
print(df)

    name  Age Address
0    Tom   20     abc
1   nick   21     xyz
2  krish   19     fgx
3   jack   18     hgf

In [45]:
#Slicing in DataFrames Using Iloc and Loc
data={'one' :pd.Series([1,2,3,4]),
     'two'  :pd.Series([10,20,30,40,]),
     'three':pd.Series([100,200,300,400])}

In [47]:
pd.DataFrame(data)

   one  two  three
0    1   10    100
1    2   20    200
2    3   30    300
3    4   40    400

In [48]:
#Basic loc opration
df.loc[1:2]

    name  Age Address
1   nick   21     xyz
2  krish   19     fgx

In [55]:
df.loc[2:4]

    name  Age Address
2  krish   19     fgx
3   jack   18     hgf

In [57]:
df.loc[1:2,'name':'age']

    name
1   nick
2  krish

In [58]:
df.iloc[:,:]

    name  Age Address
0    Tom   20     abc
1   nick   21     xyz
2  krish   19     fgx
3   jack   18     hgf

In [59]:
df.iloc[1:-1,:]

    name  Age Address
1   nick   21     xyz
2  krish   19     fgx

In [60]:
df.iloc[1:,:]

    name  Age Address
1   nick   21     xyz
2  krish   19     fgx
3   jack   18     hgf

In [61]:
df

    name  Age Address
0    Tom   20     abc
1   nick   21     xyz
2  krish   19     fgx
3   jack   18     hgf

In [62]:
df.iloc[:,2:3]

  Address
0     abc
1     xyz
2     fgx
3     hgf

In [67]:
df

    name  Age Address
0    Tom   20     abc
1   nick   21     xyz
2  krish   19     fgx
3   jack   18     hgf

In [68]:
df.iloc[[0,3],[0,2]]

   name Address
0   Tom     abc
3  jack     hgf

In [71]:
data={
    'one'    :pd.Series([1,2,3,4]),
    'two'    :pd.Series([10,20,30,40]),
    'three'  :pd.Series([100,20,300,400]),
    'four'   :pd.Series([1000,2000,3000,4000])
}
df=pd.DataFrame(data)

In [72]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [73]:
df['two']

0    10
1    20
2    30
3    40
Name: two, dtype: int64

In [74]:
df[df['two']>20]

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [78]:
#Using conditions work with loc basically
df.loc[df['two'] > 20,['three','four']]

   three  four
2    300  3000
3    400  4000

In [80]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [81]:
l=[12,13,14,15]
df['six']=l

In [82]:
df

   one  two  three  four  six
0    1   10    100  1000   12
1    2   20     20  2000   13
2    3   30    300  3000   14
3    4   40    400  4000   15

In [83]:
del df['six']

In [84]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [85]:
l=[101,102,103,104]
df['five']=l

In [86]:
df

   one  two  three  four  five
0    1   10    100  1000   101
1    2   20     20  2000   102
2    3   30    300  3000   103
3    4   40    400  4000   104

In [87]:
df.pop('five')

0    101
1    102
2    103
3    104
Name: five, dtype: int64

In [88]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [113]:
#Addition of rows

df1 = pd.DataFrame([[1,2],[3,4],[5,6]], columns=['a','b'])
df2 = pd.DataFrame([[1,2],[3,4],[5,6]], columns=['a','b'])

result = pd.concat([df1, df2])
print(result)

   a  b
0  1  2
1  3  4
2  5  6
0  1  2
1  3  4
2  5  6

In [139]:
data = {
    'one': pd.Series([1, 2, 3, 4]),
    'two': pd.Series([10, 20, 30, 40]),
    'three': pd.Series([100, 20, 300, 400]),
    'four': pd.Series([1000, 2000, 3000, 4000])
}

# Creating the DataFrame
df = pd.DataFrame(data)

# Dropping rows with index 2 and 3
df.drop([2, 3], axis=0, inplace=True)

# Displaying the resulting DataFrame
print(df)

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000

In [140]:
df.drop(['one','three'],axis=1,inplace=True)

In [142]:
df.T

         0     1
two     10    20
four  1000  2000

In [147]:
data = {
    'one': pd.Series([1, 2, 3, 4]),
    'two': pd.Series([10, 20, 30, 40]),
    'three': pd.Series([100, 20, 300, 400]),
    'four': pd.Series([1000, 2000, 3000, 4000])
}

# Creating the DataFrame
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [148]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

In [149]:
df.ndim

2

In [150]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

In [151]:
df.shape

(4, 4)

In [152]:
df.head()

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [153]:
df.tail()

   one  two  three  four
0    1   10    100  1000
1    2   20     20  2000
2    3   30    300  3000
3    4   40    400  4000

In [155]:
df.empty

False